
. // 1.x tasks
. use salary.dta, clear

. describe

Contains data from salary.dta
  obs:            50                          
 vars:             4                          19 Feb 2013 14:07
 size:           750                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
position        str9    %9s                   Respondent's work position
salary          long    %8.0g                 Monthly salary in rubles
foreigner       byte    %8.0g      foreigner
                                              Is a person foreign citizen or
                                                not
sex             byte    %8.0g      sex        Respondent's sex
-------------------------------------------------------------------------------
Sorted by: 

. tab position

Respondent' |
     s work |
   position |      Freq.     Percent        Cum.
------------+-----------------------------------
     docent |         18       36.00       36.00
   lecturer |         12       24.00       60.00
  professor |         20       40.00      100.00
------------+-----------------------------------
      Total |         50      100.00

. encode position, generate(num_position)

. tab num_position

Respondent' |
     s work |
   position |      Freq.     Percent        Cum.
------------+-----------------------------------
     docent |         18       36.00       36.00
   lecturer |         12       24.00       60.00
  professor |         20       40.00      100.00
------------+-----------------------------------
      Total |         50      100.00

. describe

Contains data from salary.dta
  obs:            50                          
 vars:             5                          19 Feb 2013 14:07
 size:           950                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
position        str9    %9s                   Respondent's work position
salary          long    %8.0g                 Monthly salary in rubles
foreigner       byte    %8.0g      foreigner
                                              Is a person foreign citizen or
                                                not
sex             byte    %8.0g      sex        Respondent's sex
num_position    long    %9.0g      num_position
                                              Respondent's work position
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. generate dollor_rub_ratio = 64

. generate tax = .
(50 missing values generated)

. replace tax = (salary / dollor_rub_ratio) * 0.13 if foreigner == 0
(33 real changes made)

. replace tax = (salary / dollor_rub_ratio) * 0.30 if foreigner == 1
(17 real changes made)

. tab tax

        tax |      Freq.     Percent        Cum.
------------+-----------------------------------
     40.625 |          1        2.00        2.00
     56.875 |          1        2.00        4.00
    60.9375 |          2        4.00        8.00
    69.0625 |          2        4.00       12.00
      81.25 |          3        6.00       18.00
   101.5625 |          1        2.00       20.00
   109.6875 |          1        2.00       22.00
     113.75 |          1        2.00       24.00
    121.875 |          1        2.00       26.00
     131.25 |          2        4.00       30.00
   136.0938 |          1        2.00       32.00
    140.625 |          1        2.00       34.00
   142.1875 |          2        4.00       38.00
        150 |          1        2.00       40.00
   158.4375 |          1        2.00       42.00
      162.5 |          3        6.00       48.00
   176.7188 |          1        2.00       50.00
   182.8125 |          1        2.00       52.00
      187.5 |          3        6.00       58.00
   192.9688 |          1        2.00       60.00
    203.125 |          1        2.00       62.00
   210.9375 |          1        2.00       64.00
    234.375 |          1        2.00       66.00
     243.75 |          2        4.00       70.00
   264.0625 |          1        2.00       72.00
     281.25 |          1        2.00       74.00
    284.375 |          2        4.00       78.00
    328.125 |          1        2.00       80.00
    365.625 |          1        2.00       82.00
     406.25 |          2        4.00       86.00
    421.875 |          2        4.00       90.00
     468.75 |          1        2.00       92.00
   507.8125 |          1        2.00       94.00
     656.25 |          1        2.00       96.00
      937.5 |          2        4.00      100.00
------------+-----------------------------------
      Total |         50      100.00

. egen rnk = rank(salary), field

. gsort -salary

. list

     +---------------------------------------------------------------+
  1. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 250000 |       no |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            507.8125             |               1             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
  2. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 200000 |       no |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              406.25             |               2             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
  3. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 200000 |      yes |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               937.5             |               2             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
  4. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 200000 |       no |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              406.25             |               2             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
  5. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 200000 |      yes |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               937.5             |               2             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
  6. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 180000 |       no | female | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             365.625             |               6             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
  7. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 140000 |       no |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             284.375             |               7             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
  8. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 140000 |      yes |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              656.25             |               7             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
  9. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 140000 |       no | female | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             284.375             |               7             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 10. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 130000 |       no |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            264.0625             |              10             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 11. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 120000 |       no |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              243.75             |              11             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 12. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 120000 |       no |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              243.75             |              11             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 13. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 100000 |       no |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             203.125             |              13             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 14. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor | 100000 |      yes | female | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              468.75             |              13             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 15. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor |  95000 |       no |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            192.9688             |              15             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 16. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor |  90000 |      yes | female | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             421.875             |              16             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 17. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  90000 |       no | female |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            182.8125             |              16             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 18. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor |  90000 |      yes | female | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             421.875             |              16             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 19. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor |  87000 |       no |   male | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            176.7188             |              19             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 20. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  80000 |       no |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               162.5             |              20             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 21. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  80000 |       no |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               162.5             |              20             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 22. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  80000 |       no |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               162.5             |              20             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 23. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor |  78000 |       no | female | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            158.4375             |              23             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 24. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  70000 |       no | female |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            142.1875             |              24             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 25. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  70000 |       no | female |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            142.1875             |              24             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 26. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  70000 |      yes |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             328.125             |              24             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 27. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  67000 |       no |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            136.0938             |              27             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 28. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  60000 |      yes | female |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              281.25             |              28             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 29. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  60000 |       no |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             121.875             |              28             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 30. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  56000 |       no | female |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              113.75             |              30             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 31. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     | professor |  54000 |       no | female | professor |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            109.6875             |              31             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 32. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  50000 |      yes |   male |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             234.375             |              32             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 33. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  50000 |       no |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            101.5625             |              32             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 34. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  45000 |      yes | female |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |            210.9375             |              34             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 35. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  40000 |      yes |   male |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               187.5             |              35             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 36. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  40000 |       no |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               81.25             |              35             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 37. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  40000 |       no |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               81.25             |              35             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 38. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  40000 |       no | female |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               81.25             |              35             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 39. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  40000 |      yes | female |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               187.5             |              35             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 40. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  40000 |      yes | female |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |               187.5             |              35             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 41. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  34000 |       no | female |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             69.0625             |              41             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 42. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  34000 |       no |   male |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             69.0625             |              41             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 43. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  32000 |      yes | female |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |                 150             |              43             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 44. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  30000 |      yes |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             140.625             |              44             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 45. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  30000 |       no |   male |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             60.9375             |              44             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 46. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  30000 |       no |   male |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |             60.9375             |              44             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 47. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |    docent |  28000 |      yes | female |    docent |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              131.25             |              47             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 48. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  28000 |      yes | female |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              131.25             |              47             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 49. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  28000 |       no | female |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              56.875             |              47             |
     +---------------------------------------------------------------+

     +---------------------------------------------------------------+
 50. |  position | salary | foreig~r |    sex | num_pos~n | dollor~o |
     |  lecturer |  20000 |       no | female |  lecturer |       64 |
     |---------------------------------------------------------------|
     |                 tax             |             rnk             |
     |              40.625             |              50             |
     +---------------------------------------------------------------+

. save salary_modif.dta, replace
file salary_modif.dta saved

. // 2.x tasks
. use data_games.dta, clear

. describe

Contains data from data_games.dta
  obs:       105,507                          
 vars:             9                          24 Jan 2020 15:56
 size:     7,174,476                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
id              double  %10.0g                ID
pack_id         double  %10.0g                pack_id
crystalls_bal~y double  %10.0g                crystalls_balance_before_buy
crystalls_bou~t double  %10.0g                crystalls_bought
country         str4    %4s                   country
payment         double  %10.0g                payment in cents
utc_timestamp   double  %10.0g                
payment_type    double  %10.0g     payment_type_rec
                                              payment_type
payment_method  double  %10.0g     payment_method_rec
                                              payment_method
-------------------------------------------------------------------------------
Sorted by: 

. drop if payment < 100 | payment > 14000
(1,702 observations deleted)

. tab payment

 payment in |
      cents |      Freq.     Percent        Cum.
------------+-----------------------------------
        102 |          4        0.00        0.00
        103 |         76        0.07        0.08
        104 |          1        0.00        0.08
        105 |          1        0.00        0.08
        106 |         15        0.01        0.09
        107 |          1        0.00        0.09
        108 |         24        0.02        0.12
        110 |        282        0.27        0.39
        111 |          3        0.00        0.39
        113 |          1        0.00        0.39
        114 |          5        0.00        0.40
        115 |          8        0.01        0.41
        116 |          1        0.00        0.41
        119 |         11        0.01        0.42
        121 |          4        0.00        0.42
        122 |          3        0.00        0.42
        123 |          4        0.00        0.43
        124 |          7        0.01        0.43
        125 |         13        0.01        0.45
        126 |          2        0.00        0.45
        127 |      3,490        3.36        3.81
        129 |         17        0.02        3.83
        132 |         17        0.02        3.84
        134 |          1        0.00        3.84
        136 |          3        0.00        3.85
        137 |          6        0.01        3.85
        138 |          1        0.00        3.85
        139 |          1        0.00        3.86
        140 |          3        0.00        3.86
        141 |         14        0.01        3.87
        142 |          8        0.01        3.88
        143 |          1        0.00        3.88
        144 |          5        0.00        3.89
        148 |          5        0.00        3.89
        149 |        623        0.60        4.49
        150 |          2        0.00        4.49
        151 |          1        0.00        4.49
        152 |          1        0.00        4.49
        153 |          1        0.00        4.49
        154 |         76        0.07        4.57
        155 |         23        0.02        4.59
        156 |          1        0.00        4.59
        157 |         68        0.07        4.66
        158 |         13        0.01        4.67
        159 |          6        0.01        4.68
        162 |         33        0.03        4.71
        165 |          2        0.00        4.71
        166 |         29        0.03        4.74
        169 |          2        0.00        4.74
        170 |          1        0.00        4.74
        172 |         27        0.03        4.77
        173 |          8        0.01        4.77
        174 |          1        0.00        4.77
        175 |          1        0.00        4.78
        177 |         18        0.02        4.79
        178 |          9        0.01        4.80
        180 |          1        0.00        4.80
        182 |          2        0.00        4.80
        183 |          4        0.00        4.81
        185 |          8        0.01        4.82
        186 |         40        0.04        4.85
        187 |          1        0.00        4.86
        190 |        288        0.28        5.13
        194 |          1        0.00        5.13
        198 |          8        0.01        5.14
        200 |          1        0.00        5.14
        203 |          2        0.00        5.14
        205 |     14,125       13.61       18.75
        206 |          3        0.00       18.75
        207 |          3        0.00       18.76
        208 |          2        0.00       18.76
        209 |          2        0.00       18.76
        210 |          1        0.00       18.76
        211 |          5        0.00       18.77
        212 |         11        0.01       18.78
        213 |         25        0.02       18.80
        214 |          1        0.00       18.80
        216 |         13        0.01       18.82
        217 |         20        0.02       18.83
        219 |          3        0.00       18.84
        220 |        204        0.20       19.03
        221 |        150        0.14       19.18
        222 |         19        0.02       19.20
        224 |          1        0.00       19.20
        225 |          3        0.00       19.20
        228 |          3        0.00       19.20
        230 |          4        0.00       19.21
        233 |         33        0.03       19.24
        236 |         15        0.01       19.25
        237 |          4        0.00       19.26
        239 |         12        0.01       19.27
        241 |          3        0.00       19.27
        243 |          5        0.00       19.28
        244 |         37        0.04       19.31
        246 |         12        0.01       19.32
        247 |          3        0.00       19.33
        250 |          1        0.00       19.33
        251 |         11        0.01       19.34
        258 |          5        0.00       19.34
        262 |          1        0.00       19.34
        264 |         39        0.04       19.38
        265 |          1        0.00       19.38
        266 |          2        0.00       19.38
        271 |          1        0.00       19.39
        272 |          7        0.01       19.39
        273 |          2        0.00       19.39
        277 |          3        0.00       19.40
        279 |        136        0.13       19.53
        282 |          4        0.00       19.53
        283 |        517        0.50       20.03
        287 |          2        0.00       20.03
        288 |          7        0.01       20.04
        291 |          1        0.00       20.04
        297 |         18        0.02       20.06
        302 |          1        0.00       20.06
        306 |          1        0.00       20.06
        308 |         20        0.02       20.08
        309 |        514        0.50       20.57
        310 |          8        0.01       20.58
        313 |         90        0.09       20.67
        315 |          3        0.00       20.67
        316 |          4        0.00       20.67
        317 |          2        0.00       20.68
        320 |          5        0.00       20.68
        321 |      5,220        5.03       25.71
        326 |          2        0.00       25.71
        327 |          9        0.01       25.72
        328 |          2        0.00       25.72
        330 |         98        0.09       25.82
        333 |          1        0.00       25.82
        334 |          1        0.00       25.82
        336 |          1        0.00       25.82
        339 |          2        0.00       25.82
        341 |          2        0.00       25.82
        345 |         20        0.02       25.84
        355 |         20        0.02       25.86
        361 |          8        0.01       25.87
        365 |          4        0.00       25.87
        368 |          6        0.01       25.88
        371 |          1        0.00       25.88
        373 |         32        0.03       25.91
        374 |         40        0.04       25.95
        375 |        989        0.95       26.90
        376 |          2        0.00       26.90
        384 |          2        0.00       26.91
        387 |          5        0.00       26.91
        388 |          6        0.01       26.92
        394 |          1        0.00       26.92
        395 |          5        0.00       26.92
        397 |         23        0.02       26.94
        401 |          1        0.00       26.95
        403 |          1        0.00       26.95
        405 |         14        0.01       26.96
        406 |         20        0.02       26.98
        407 |          2        0.00       26.98
        408 |          4        0.00       26.99
        409 |          4        0.00       26.99
        412 |          1        0.00       26.99
        416 |          3        0.00       26.99
        417 |         39        0.04       27.03
        422 |          2        0.00       27.03
        424 |          1        0.00       27.03
        426 |          1        0.00       27.03
        427 |          7        0.01       27.04
        431 |         23        0.02       27.06
        434 |          1        0.00       27.06
        435 |         17        0.02       27.08
        437 |          7        0.01       27.09
        439 |          1        0.00       27.09
        440 |          2        0.00       27.09
        441 |         17        0.02       27.11
        445 |          1        0.00       27.11
        449 |          1        0.00       27.11
        450 |         49        0.05       27.16
        452 |          1        0.00       27.16
        455 |          1        0.00       27.16
        459 |          1        0.00       27.16
        460 |          1        0.00       27.16
        461 |          1        0.00       27.16
        466 |          8        0.01       27.17
        469 |          1        0.00       27.17
        471 |         20        0.02       27.19
        473 |          1        0.00       27.19
        474 |          5        0.00       27.19
        475 |          2        0.00       27.20
        476 |        333        0.32       27.52
        489 |         35        0.03       27.55
        490 |         14        0.01       27.56
        494 |          1        0.00       27.57
        495 |          2        0.00       27.57
        500 |          2        0.00       27.57
        502 |          7        0.01       27.58
        509 |          1        0.00       27.58
        513 |        133        0.13       27.70
        514 |     13,383       12.89       40.60
        515 |      5,043        4.86       45.46
        516 |          1        0.00       45.46
        524 |         17        0.02       45.47
        527 |          3        0.00       45.48
        534 |         22        0.02       45.50
        535 |          2        0.00       45.50
        543 |          1        0.00       45.50
        545 |         27        0.03       45.53
        549 |          2        0.00       45.53
        550 |        218        0.21       45.74
        552 |          3        0.00       45.74
        553 |        238        0.23       45.97
        555 |          3        0.00       45.97
        556 |         33        0.03       46.00
        559 |         27        0.03       46.03
        562 |          1        0.00       46.03
        563 |          2        0.00       46.03
        570 |          1        0.00       46.03
        572 |          8        0.01       46.04
        577 |          2        0.00       46.04
        578 |          4        0.00       46.05
        594 |         41        0.04       46.09
        595 |          8        0.01       46.10
        600 |          1        0.00       46.10
        608 |          5        0.00       46.10
        615 |          1        0.00       46.10
        618 |          1        0.00       46.10
        619 |         16        0.02       46.12
        625 |          1        0.00       46.12
        626 |         44        0.04       46.16
        631 |          1        0.00       46.16
        632 |          5        0.00       46.17
        633 |          1        0.00       46.17
        634 |          1        0.00       46.17
        642 |          2        0.00       46.17
        644 |      4,926        4.75       50.92
        645 |          1        0.00       50.92
        646 |          1        0.00       50.92
        648 |         19        0.02       50.94
        653 |          2        0.00       50.94
        655 |          2        0.00       50.94
        656 |          1        0.00       50.94
        657 |          3        0.00       50.94
        659 |          4        0.00       50.95
        660 |          1        0.00       50.95
        662 |         22        0.02       50.97
        678 |          9        0.01       50.98
        684 |          1        0.00       50.98
        686 |          3        0.00       50.98
        691 |          1        0.00       50.98
        698 |        209        0.20       51.19
        703 |          3        0.00       51.19
        704 |          1        0.00       51.19
        708 |        610        0.59       51.78
        710 |         16        0.02       51.79
        711 |          2        0.00       51.79
        714 |          2        0.00       51.80
        715 |          1        0.00       51.80
        719 |         65        0.06       51.86
        720 |        115        0.11       51.97
        722 |          7        0.01       51.98
        729 |          1        0.00       51.98
        736 |          3        0.00       51.98
        742 |          1        0.00       51.98
        749 |      1,069        1.03       53.01
        750 |          2        0.00       53.01
        752 |          8        0.01       53.02
        757 |          1        0.00       53.02
        767 |          1        0.00       53.02
        775 |          2        0.00       53.03
        776 |          5        0.00       53.03
        788 |          1        0.00       53.03
        789 |          2        0.00       53.03
        791 |          2        0.00       53.04
        792 |          1        0.00       53.04
        793 |          1        0.00       53.04
        795 |          5        0.00       53.04
        802 |          2        0.00       53.04
        806 |          1        0.00       53.04
        812 |         13        0.01       53.06
        815 |          1        0.00       53.06
        817 |         14        0.01       53.07
        821 |          1        0.00       53.07
        823 |          1        0.00       53.07
        833 |          2        0.00       53.08
        834 |         34        0.03       53.11
        844 |          1        0.00       53.11
        849 |          1        0.00       53.11
        858 |          3        0.00       53.11
        863 |         17        0.02       53.13
        879 |          6        0.01       53.14
        900 |          1        0.00       53.14
        910 |          1        0.00       53.14
        923 |          1        0.00       53.14
        927 |          1        0.00       53.14
        928 |         22        0.02       53.16
        932 |         15        0.01       53.17
        939 |         34        0.03       53.21
        940 |          2        0.00       53.21
        943 |         19        0.02       53.23
        950 |          2        0.00       53.23
        952 |        381        0.37       53.60
        953 |          3        0.00       53.60
        954 |          1        0.00       53.60
        955 |          1        0.00       53.60
        962 |          1        0.00       53.60
        966 |          4        0.00       53.61
        973 |          1        0.00       53.61
        974 |          1        0.00       53.61
        978 |         33        0.03       53.64
        982 |          1        0.00       53.64
        992 |         12        0.01       53.65
       1000 |          1        0.00       53.65
       1005 |          1        0.00       53.65
       1013 |          4        0.00       53.66
       1017 |          3        0.00       53.66
       1028 |      4,370        4.21       57.87
       1029 |     12,605       12.14       70.01
       1034 |          1        0.00       70.01
       1045 |          1        0.00       70.02
       1050 |          1        0.00       70.02
       1053 |          3        0.00       70.02
       1056 |          2        0.00       70.02
       1057 |          1        0.00       70.02
       1064 |          3        0.00       70.03
       1067 |          1        0.00       70.03
       1069 |          7        0.01       70.03
       1075 |          1        0.00       70.03
       1089 |          2        0.00       70.04
       1090 |         31        0.03       70.07
       1100 |        234        0.23       70.29
       1107 |        303        0.29       70.58
       1113 |         25        0.02       70.61
       1124 |          6        0.01       70.61
       1125 |          1        0.00       70.61
       1141 |          1        0.00       70.62
       1142 |          2        0.00       70.62
       1172 |          6        0.01       70.62
       1187 |          1        0.00       70.62
       1190 |          1        0.00       70.62
       1196 |          1        0.00       70.63
       1207 |          1        0.00       70.63
       1214 |          1        0.00       70.63
       1215 |          2        0.00       70.63
       1219 |          1        0.00       70.63
       1224 |          2        0.00       70.63
       1225 |          1        0.00       70.63
       1226 |          2        0.00       70.64
       1230 |          1        0.00       70.64
       1237 |          2        0.00       70.64
       1250 |          2        0.00       70.64
       1254 |          5        0.00       70.64
       1256 |          1        0.00       70.65
       1264 |          1        0.00       70.65
       1268 |          1        0.00       70.65
       1271 |          1        0.00       70.65
       1289 |      2,422        2.33       72.98
       1296 |         12        0.01       72.99
       1301 |          1        0.00       72.99
       1311 |          1        0.00       73.00
       1314 |          1        0.00       73.00
       1318 |          2        0.00       73.00
       1320 |          8        0.01       73.01
       1324 |         17        0.02       73.02
       1354 |         50        0.05       73.07
       1360 |          2        0.00       73.07
       1371 |          1        0.00       73.07
       1394 |          1        0.00       73.07
       1397 |        281        0.27       73.35
       1406 |          1        0.00       73.35
       1407 |          4        0.00       73.35
       1408 |          2        0.00       73.35
       1412 |          1        0.00       73.35
       1415 |         11        0.01       73.36
       1417 |        561        0.54       73.90
       1426 |          1        0.00       73.90
       1428 |          1        0.00       73.91
       1445 |          6        0.01       73.91
       1467 |         18        0.02       73.93
       1499 |        843        0.81       74.74
       1500 |          1        0.00       74.74
       1507 |          1        0.00       74.74
       1543 |         10        0.01       74.75
       1547 |          1        0.00       74.75
       1548 |         27        0.03       74.78
       1551 |          5        0.00       74.78
       1565 |         31        0.03       74.81
       1574 |         26        0.03       74.84
       1605 |          2        0.00       74.84
       1611 |          1        0.00       74.84
       1612 |         25        0.02       74.87
       1620 |          1        0.00       74.87
       1625 |          7        0.01       74.87
       1632 |          1        0.00       74.88
       1636 |         14        0.01       74.89
       1643 |          1        0.00       74.89
       1667 |          1        0.00       74.89
       1669 |         24        0.02       74.91
       1675 |          8        0.01       74.92
       1677 |          1        0.00       74.92
       1689 |          1        0.00       74.92
       1701 |          1        0.00       74.92
       1728 |          8        0.01       74.93
       1735 |          1        0.00       74.93
       1750 |          1        0.00       74.93
       1757 |          5        0.00       74.94
       1760 |          1        0.00       74.94
       1774 |          2        0.00       74.94
       1792 |          1        0.00       74.94
       1865 |          2        0.00       74.94
       1874 |         12        0.01       74.96
       1897 |          3        0.00       74.96
       1900 |          6        0.01       74.96
       1901 |         10        0.01       74.97
       1903 |          4        0.00       74.98
       1904 |        234        0.23       75.20
       1910 |          1        0.00       75.20
       1911 |          1        0.00       75.21
       1934 |      1,249        1.20       76.41
       1984 |          1        0.00       76.41
       1999 |          2        0.00       76.41
       2025 |          1        0.00       76.41
       2039 |          3        0.00       76.42
       2058 |     11,552       11.13       87.54
       2084 |          1        0.00       87.54
       2111 |          2        0.00       87.55
       2118 |          1        0.00       87.55
       2127 |          1        0.00       87.55
       2161 |        188        0.18       87.73
       2167 |          2        0.00       87.73
       2176 |          1        0.00       87.73
       2181 |         17        0.02       87.75
       2186 |          1        0.00       87.75
       2200 |          3        0.00       87.75
       2214 |        103        0.10       87.85
       2227 |         26        0.03       87.88
       2249 |        591        0.57       88.45
       2325 |          5        0.00       88.45
       2359 |         23        0.02       88.47
       2379 |          6        0.01       88.48
       2430 |          1        0.00       88.48
       2438 |          6        0.01       88.49
       2445 |          3        0.00       88.49
       2446 |          1        0.00       88.49
       2448 |          1        0.00       88.49
       2473 |          5        0.00       88.50
       2504 |          9        0.01       88.50
       2508 |          3        0.00       88.51
       2573 |         86        0.08       88.59
       2584 |          2        0.00       88.59
       2589 |          6        0.01       88.60
       2593 |          8        0.01       88.61
       2604 |          1        0.00       88.61
       2624 |          3        0.00       88.61
       2661 |          1        0.00       88.61
       2676 |          2        0.00       88.61
       2728 |          2        0.00       88.61
       2768 |          1        0.00       88.62
       2794 |        174        0.17       88.78
       2800 |          4        0.00       88.79
       2816 |          1        0.00       88.79
       2836 |        260        0.25       89.04
       2855 |        107        0.10       89.14
       2978 |          2        0.00       89.14
       3065 |          1        0.00       89.14
       3087 |      1,050        1.01       90.16
       3088 |      3,767        3.63       93.78
       3096 |          5        0.00       93.79
       3130 |         30        0.03       93.82
       3211 |          2        0.00       93.82
       3225 |      1,150        1.11       94.93
       3273 |         13        0.01       94.94
       3322 |         74        0.07       95.01
       3341 |         20        0.02       95.03
       3493 |          7        0.01       95.04
       3545 |          2        0.00       95.04
       3602 |          3        0.00       95.04
       3603 |         11        0.01       95.05
       3612 |          1        0.00       95.05
       3749 |        683        0.66       95.71
       4064 |          6        0.01       95.72
       4174 |          6        0.01       95.72
       4192 |         59        0.06       95.78
       4254 |        126        0.12       95.90
       4341 |          1        0.00       95.90
       4357 |          1        0.00       95.90
       4718 |          9        0.01       95.91
       4759 |        113        0.11       96.02
       4890 |          5        0.00       96.03
       5147 |      2,889        2.78       98.81
       5536 |         54        0.05       98.86
       5568 |         19        0.02       98.88
       6452 |        139        0.13       99.01
       6986 |         43        0.04       99.05
       7091 |         74        0.07       99.13
       7224 |          3        0.00       99.13
       7499 |        135        0.13       99.26
       8613 |          1        0.00       99.26
       8682 |          1        0.00       99.26
       9518 |         23        0.02       99.28
      10295 |        724        0.70       99.98
      11073 |         13        0.01       99.99
      11138 |          4        0.00      100.00
      13973 |          3        0.00      100.00
------------+-----------------------------------
      Total |    103,805      100.00

. recode payment (100/500 = 1 "1st group") (501/1000 = 2 "2nd group") (1001/200
> 0 = 3 "3rd group") (2000/max = 4 "4rd group" ), gen(payment_groups)
(103805 differences between payment and payment_groups)

. // generate tax = .
. // replace tax = (salary / dollor_rub_ratio) * 0.13 if foreigner == 0
. tabulate payment_groups

  RECODE of |
    payment |
(payment in |
     cents) |      Freq.     Percent        Cum.
------------+-----------------------------------
  1st group |     28,618       27.57       27.57
  2nd group |     27,077       26.08       53.65
  3rd group |     23,624       22.76       76.41
  4rd group |     24,486       23.59      100.00
------------+-----------------------------------
      Total |    103,805      100.00

. 
end of do-file
