
. use Worldbank_data.dta, clear

. egen zhightech = std(hightech)
(82 missing values generated)

. egen zinternet = std(internet)
(15 missing values generated)

. egen zexport = std(export)
(73 missing values generated)

. egen zmobile = std(mobile)
(13 missing values generated)

. cluster  wardslinkage   zinternet zexport zmobile zhightech , measure(L2) nam
> e(myclust)

. cluster stop myclust,  rule(calinski) 

+---------------------------+
|             |  Calinski/  |
|  Number of  |  Harabasz   |
|  clusters   |  pseudo-F   |
|-------------+-------------|
|      2      |    24.89    |
|      3      |    29.85    |
|      4      |    47.88    |
|      5      |    44.57    |
|      6      |    45.14    |
|      7      |    47.92    |
|      8      |    48.56    |
|      9      |    48.53    |
|     10      |    48.01    |
|     11      |    53.49    |
|     12      |    53.38    |
|     13      |    54.65    |
|     14      |    53.35    |
|     15      |    53.69    |
+---------------------------+

. // cluster dendrogram myclust, horizontal cutnumber(4)
. cluster generate clustdes = groups (4), name (myclust) 

. sort clustdes

. by clustdes: list  if _n<=5

-------------------------------------------------------------------------------
-> clustdes = 1

     +-----------------------------------------------------------------------+
  1. | year  | groups  | countr~me  |  count~de  |   internet  |     secure  |
     | 2015  |      1  |      Oman  |       OMN  |  74.174166  |  87.739985  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 18.513862 |         . | 10.460671 | 2.043e+08 | 159.86056 | -.2649702 |
     |-----------------------------------------------------------------------|
     | zinter~t |   zexport |   zmobile | myclu~id  | myclu~rd  | myclust~t  |
     | .8818077 | -.7772434 |  1.231706 |       77  |        3  | .26741084  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      1                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  2. | year  | groups  | countr~me  |  count~de  |   internet  |     secure  |
     | 2015  |      2  | Mauritius  |       MUS  |  50.139318  |  175.82696  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 33.076914 | 42.174077 | 30.313159 |    673785 | 140.57329 | -.2686404 |
     |-----------------------------------------------------------------------|
     | zinter~t |   zexport |   zmobile | myclu~id  | myclu~rd  | myclust~t  |
     | .0539448 | -.0955342 |  .7760611 |       65  |       43  | .48737473  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      1                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  3. | year  | groups  | countr~me  |  count~de  |   internet  |     secure  |
     | 2015  |      1  |    Cyprus  |       CYP  |    71.7159  |  677.07886  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 4.1031941 |  16.88492 | 27.793285 |  26759530 | 95.400341 | -.2681701 |
     |-----------------------------------------------------------------------|
     | zinter~t |   zexport |   zmobile | myclu~id  | myclu~rd  | myclust~t  |
     | .7971345 | -1.451819 | -.2911109 |       28  |        9  | .69675349  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      1                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  4. | year  | groups  | countr~me  |  count~de  |   internet  |     secure  |
     | 2015  |      1  |    Latvia  |       LVA  |    79.2006  |  456.42021  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 29.280048 | 34.663652 | 19.474727 | 1.015e+09 | 126.97453 | -.2503541 |
     |-----------------------------------------------------------------------|
     | zinter~t |   zexport |   zmobile | myclu~id  | myclu~rd  | myclust~t  |
     |  1.05494 | -.2732688 |  .4548021 |       57  |       72  | .49280401  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      1                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  5. | year  | groups  | countr~me  |  count~de  |   internet  |     secure  |
     | 2015  |      2  |   Bolivia  |       BOL  |       45.1  |  15.758009  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 20.932267 |         . | 7.9920381 |  24935819 | 92.183852 |  -.268203 |
     |-----------------------------------------------------------------------|
     | zinter~t |   zexport |   zmobile | myclu~id  | myclu~rd  | myclust~t  |
     | -.119631 | -.6640357 | -.3670976 |       14  |       16  |  1.109895  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      1                                |
     +-----------------------------------------------------------------------+

-------------------------------------------------------------------------------
-> clustdes = 2

     +-----------------------------------------------------------------------+
  1. | year  | groups  | country_n~e  | count~de  |  internet  |     secure  |
     | 2015  |      3  |   Guatemala  |      GTM  |      27.1  |  20.742956  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 28.130752 | 17.847173 |  10.57423 | 2.285e+08 |  111.4813 | -.2645337 |
     |-----------+-----------+-----------+-----------------------------------|
     | zinternet |   zexport |   zmobile | myclu~id | myclu~rd  | myclust~t  |
     |  -.739628 | -.3270683 |   .088788 |       42 |       45  | .75723425  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      2                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  2. | year  | groups  | country_n~e  | count~de  |  internet  |     secure  |
     | 2015  |      3  |  Mozambique  |      MOZ  |         9  |  2.1802952  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 6.2733849 | 52.917207 | .32922561 |  31240449 | 74.238848 | -.2680893 |
     |-----------+-----------+-----------+-----------------------------------|
     | zinternet |   zexport |   zmobile | myclu~id | myclu~rd  | myclust~t  |
     |  -1.36307 | -1.350231 | -.7910329 |       71 |       68  | 1.2635529  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      2                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  3. | year  | groups  | country_n~e  | count~de  |  internet  |     secure  |
     | 2015  |      2  |     Algeria  |      DZA  |      38.2  |   2.546228  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 59.256825 | 58.012028 |  8.041628 |   2449466 | 113.03109 | -.2686084 |
     |-----------+-----------+-----------+-----------------------------------|
     | zinternet |   zexport |   zmobile | myclu~id | myclu~rd  | myclust~t  |
     | -.3572965 |   1.12997 |  .1254006 |        2 |        4  | .51235865  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      2                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  4. | year  | groups  | country_n~e  | count~de  |  internet  |     secure  |
     | 2015  |      3  |    Pakistan  |      PAK  |        18  |  2.3713129  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 72.842069 | 33.296917 |  1.589715 | 2.594e+08 | 66.916623 | -.2639756 |
     |-----------+-----------+-----------+-----------------------------------|
     | zinternet |   zexport |   zmobile | myclu~id | myclu~rd  | myclust~t  |
     | -1.053071 |  1.765907 |  -.964014 |       78 |       83  | .42489582  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      2                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  5. | year  | groups  | country_n~e  | count~de  |  internet  |     secure  |
     | 2015  |      3  | Yemen, Rep.  |      YEM  | 25.099514  |  .63356678  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 56.462032 |         . | 4.6798354 |   2946931 | 67.980973 | -.2685994 |
     |-----------+-----------+-----------+-----------------------------------|
     | zinternet |   zexport |   zmobile | myclu~id | myclu~rd  | myclust~t  |
     | -.8085333 |  .9991434 | -.9388697 |      111 |      108  |  1.319401  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      2                                |
     +-----------------------------------------------------------------------+

-------------------------------------------------------------------------------
-> clustdes = 3

     +-----------------------------------------------------------------------+
  1. | year | groups |   country_name  | count~de  |  internet  |    secure  |
     | 2015 |      1 |         Kuwait  |      KWT  | 82.079115  | 223.27192  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     |  54.76167 | 22.562036 | 13.395103 | 1.384e+08 | 231.76319 | -.2661577 |
     |-----------------------------------------------------------------------|
     | zinter~t |  zexport  |  zmobile  | myclu~id  | myclu~rd  | myclust~t  |
     | 1.154088 | .9195479  | 2.930344  |       55  |       60  | 31.541663  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      3                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  2. | year | groups |   country_name  | count~de  |  internet  |    secure  |
     | 2015 |      1 | United Kingdom  |      GBR  |   92.0003  | 1382.5675  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 47.854272 | 47.677185 | 52.648762 | 6.942e+10 | 125.75084 |  .9828285 |
     |-----------------------------------------------------------------------|
     | zinter~t |  zexport  |  zmobile  | myclu~id  | myclu~rd  | myclust~t  |
     | 1.495816 | .5962066  | .4258935  |      107  |       54  | 1.5934288  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      3                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  3. | year | groups |   country_name  | count~de  |  internet  |    secure  |
     | 2015 |      1 |       Malaysia  |      MYS  | 71.064068  | 103.78818  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 35.564959 | 40.269935 | 14.337326 | 5.726e+10 | 143.91291 |  .7636111 |
     |-----------------------------------------------------------------------|
     | zinter~t |  zexport  |  zmobile  | myclu~id  | myclu~rd  | myclust~t  |
     | .7746826 | .0209334  | .8549566  |       63  |      111  | 12.395203  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      3                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  4. | year | groups |   country_name  | count~de  |  internet  |    secure  |
     | 2015 |      1 |          Malta  |      MLT  |    76.184  | 1866.3075  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 50.503147 |  54.65589 | 53.387101 | 6.213e+08 | 129.29791 | -.2574518 |
     |-----------------------------------------------------------------------|
     | zinter~t |  zexport  |  zmobile  | myclu~id  | myclu~rd  | myclust~t  |
     |  .951035 | .7202028  | .5096901  |       64  |       12  | .64029095  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      3                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  5. | year | groups |   country_name  | count~de  |  internet  |    secure  |
     | 2015 |      1 |        Austria  |      AUT  |   83.9263  | 1500.5073  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 38.662816 | 45.395184 | 42.182763 | 1.595e+10 | 157.40826 |   .018854 |
     |-----------------------------------------------------------------------|
     | zinter~t |  zexport  |  zmobile  | myclu~id  | myclu~rd  | myclust~t  |
     | 1.217713 | .1659466  | 1.173773  |        7  |       94  | .44561082  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      3                                |
     +-----------------------------------------------------------------------+

-------------------------------------------------------------------------------
-> clustdes = 4

     +------------------------------------------------------------------------+
  1. | year | groups | count~me | count~de | internet |    secure |    export |
     | 2015 |      2 |    China |      CHN |     50.3 | 10.117268 | 44.156282 |
     |------------------------------------------------+-----------+-----------|
     |    import | telephone |  hightech |    mobile  | zhight~h  | zinter~t  |
     | 19.004245 | 16.481036 | 5.543e+11 | 93.161421  | 9.723992  | .0594793  |
     |-----------------------+-----------+------------------------+-----------|
     |  zexport |   zmobile  | myclu~id  | myclu~rd  | myclust~t  | clustdes  |
     | .4231005 | -.3440033  |       24  |       81  | 6.7666829  |        4  |
     +------------------------------------------------------------------------+

-------------------------------------------------------------------------------
-> clustdes = .

     +----------------------------------------------------------------------+
  1. | year  | groups  |             country_name  | count~de  |  internet  |
     | 2015  |      1  |            Faroe Islands  |      FRO  |      94.2  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     |         . |         . |         . |  34.34621 |        . | 127.28301 |
     |-----------+-----------+----------------------------------+-----------|
     | zhightech | zinternet |  zexport |   zmobile | myclu~id  | myclu~rd  |
     |         . |  1.571583 |        . |  .4620898 |        .  |        .  |
     |----------------------------------+-----------------------------------|
     |             myclus~t             |             clustdes              |
     |                    .             |                    .              |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. | year  | groups  |             country_name  | count~de  |  internet  |
     | 2015  |      2  |      Antigua and Barbuda  |      ATG  |      65.2  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     |  304.9511 |         . |         . | 13.068763 |        0 | 137.22202 |
     |-----------+-----------+----------------------------------+-----------|
     | zhightech | zinternet |  zexport |   zmobile | myclu~id  | myclu~rd  |
     | -.2686526 |   .572699 |        . |  .6968902 |        .  |        .  |
     |----------------------------------+-----------------------------------|
     |             myclus~t             |             clustdes              |
     |                    .             |                    .              |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. | year  | groups  |             country_name  | count~de  |  internet  |
     | 2015  |      3  |                   Guinea  |      GIN  |       4.7  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     | .47586606 |         . |         . |         0 |  2448491 | 87.173664 |
     |-----------+-----------+----------------------------------+-----------|
     | zhightech | zinternet |  zexport |   zmobile | myclu~id  | myclu~rd  |
     | -.2686084 |  -1.51118 |        . |  -.485459 |        .  |        .  |
     |----------------------------------+-----------------------------------|
     |             myclus~t             |             clustdes              |
     |                    .             |                    .              |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. | year  | groups  |             country_name  | count~de  |  internet  |
     | 2015  |      3  |              Afghanistan  |      AFG  |      8.26  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     | 1.4142288 | 72.652794 | 9.0531542 |  .3436771 |        . | 61.577619 |
     |-----------+-----------+----------------------------------+-----------|
     | zhightech | zinternet |  zexport |   zmobile | myclu~id  | myclu~rd  |
     |         . | -1.388558 | 1.757047 | -1.090143 |        .  |        .  |
     |----------------------------------+-----------------------------------|
     |             myclus~t             |             clustdes              |
     |                    .             |                    .              |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. | year  | groups  |             country_name  | count~de  |  internet  |
     | 2015  |      3  | Central African Republic  |      CAF  | 4.5632644  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     |         . |         . |         . | .02081997 |        . | 20.445206 |
     |-----------+-----------+----------------------------------+-----------|
     | zhightech | zinternet |  zexport |   zmobile | myclu~id  | myclu~rd  |
     |         . |  -1.51589 |        . | -2.061861 |        .  |        .  |
     |----------------------------------+-----------------------------------|
     |             myclus~t             |             clustdes              |
     |                    .             |                    .              |
     +----------------------------------------------------------------------+


. save Worldbank_data_with_clusters.dta, replace
file Worldbank_data_with_clusters.dta saved

. use video_games_sales.dta, clear

. destring Global_Sales User_Score, replace
Global_Sales has all characters numeric; replaced as double
User_Score contains nonnumeric characters; no replace

. egen zCritic_Score = std(Critic_Score)
(8604 missing values generated)

. egen zUser_Count = std(User_Count)
(9154 missing values generated)

. egen zGlobal_Sales = std(Global_Sales)

. egen zUser_Score = std(User_Score)
type mismatch
r(109);

end of do-file
r(109);
