
. use Worldbank_data.dta, clear

. egen zhightech = std(hightech)
(82 missing values generated)

. egen zinternet = std(internet)
(15 missing values generated)

. egen zexport = std(export)
(73 missing values generated)

. egen zmobile = std(mobile)
(13 missing values generated)

. cluster  wardslinkage   zinternet zexport zmobile zhightech , measure(L2) nam
> e(myclust)

. cluster stop myclust,  rule(calinski) 

+---------------------------+
|             |  Calinski/  |
|  Number of  |  Harabasz   |
|  clusters   |  pseudo-F   |
|-------------+-------------|
|      2      |    24.89    |
|      3      |    29.85    |
|      4      |    47.88    |
|      5      |    44.57    |
|      6      |    45.14    |
|      7      |    47.92    |
|      8      |    48.56    |
|      9      |    48.53    |
|     10      |    48.01    |
|     11      |    53.49    |
|     12      |    53.38    |
|     13      |    54.65    |
|     14      |    53.35    |
|     15      |    53.69    |
+---------------------------+

. cluster dendrogram myclust, horizontal cutnumber(4)

. cluster generate clustdes = groups (4), name (myclust) 

. sort clustdes

. by clustdes: list  if _n<=5

-------------------------------------------------------------------------------
-> clustdes = 1

     +-----------------------------------------------------------------------+
  1. | year | groups |      country_name | count~de |  internet |    secure  |
     | 2015 |      2 |           Albania |      ALB | 63.252933 | 37.727137  |
     |-----------------------------------+-----------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 25.303169 | 11.124101 |  7.091628 |  15123662 | 106.38021 | -.2683799 |
     |-----------+-----------+-----------------------------------------------|
     | zinternet |   zexport |  zmobile | myclu~id  | myclu~rd  | myclust~t  |
     |  .5056338 | -.4594299 | -.031721 |        1  |        1  |  .2702146  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      1                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  2. | year | groups |      country_name | count~de |  internet |    secure  |
     | 2015 |      2 |          Bulgaria |      BGR |   56.6563 | 181.52712  |
     |-----------------------------------+-----------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 34.337671 |         . | 23.261894 | 1.108e+09 | 129.27171 | -.2486829 |
     |-----------+-----------+-----------------------------------------------|
     | zinternet |   zexport |  zmobile | myclu~id  | myclu~rd  | myclust~t  |
     |  .2784175 | -.0365172 | .5090712 |       19  |      102  | 1.0274319  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      1                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  3. | year | groups |      country_name | count~de |  internet |    secure  |
     | 2015 |      1 |         Lithuania |      LTU |    71.378 | 243.62595  |
     |-----------------------------------+-----------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     |  22.72078 | 22.480804 | 18.737073 | 1.777e+09 | 139.51638 | -.2366168 |
     |-----------+-----------+-----------------------------------------------|
     | zinternet |   zexport |  zmobile | myclu~id  | myclu~rd  | myclust~t  |
     |  .7854958 | -.5803139 | .7510927 |       58  |       75  |  1.225505  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      1                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  4. | year | groups |      country_name | count~de |  internet |    secure  |
     | 2015 |      2 |        Cabo Verde |      CPV | 43.019626 |    51.873  |
     |-----------------------------------+-----------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 13.675766 | 38.448087 | 11.499956 |         0 | 127.15226 | -.2686526 |
     |-----------+-----------+-----------------------------------------------|
     | zinternet |   zexport |  zmobile | myclu~id  | myclu~rd  | myclust~t  |
     | -.1912879 | -1.003719 | .4590009 |       21  |       98  | .63091886  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      1                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  5. | year | groups |      country_name | count~de |  internet |    secure  |
     | 2015 |      1 | Brunei Darussalam |      BRN |      71.2 | 203.21937  |
     |-----------------------------------+-----------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 5.3855559 |  58.13301 | 8.9569444 |  75036399 | 108.13112 | -.2672998 |
     |-----------+-----------+-----------------------------------------------|
     | zinternet |   zexport |  zmobile | myclu~id  | myclu~rd  | myclust~t  |
     |  .7793647 | -1.391791 | .0096428 |       18  |       39  | .86404414  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      1                                |
     +-----------------------------------------------------------------------+

-------------------------------------------------------------------------------
-> clustdes = 2

     +----------------------------------------------------------------------+
  1. | year  | groups  |           country_name  |  count~de  |   internet  |
     | 2015  |      3  |              Nicaragua  |       NIC  |  19.704291  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     |  14.30443 | 59.139935 | 22.280831 | 5.6583782 |  9962232 | 116.10548 |
     |-----------+-----------+-----------+-----------+----------+-----------|
     | zhightech | zinternet |   zexport |   zmobile | myclu~id | myclu~rd  |
     | -.2684729 | -.9943678 |  1.124498 |  .1980303 |       75 |      101  |
     |-----------------------------------+----------------------------------|
     |             myclust~t             |             clustdes             |
     |              .5635279             |                    2             |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. | year  | groups  |           country_name  |  count~de  |   internet  |
     | 2015  |      3  |                  Nepal  |       NPL  |  17.581618  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     |  3.787653 | 62.740474 | 18.678284 | 2.9779229 |  2792696 | 96.749108 |
     |-----------+-----------+-----------+-----------+----------+-----------|
     | zhightech | zinternet |   zexport |   zmobile | myclu~id | myclu~rd  |
     | -.2686022 | -1.067482 |  1.293043 | -.2592474 |       72 |       95  |
     |-----------------------------------+----------------------------------|
     |             myclust~t             |             clustdes             |
     |             .46907318             |                    2             |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. | year  | groups  |           country_name  |  count~de  |   internet  |
     | 2015  |      3  |        Solomon Islands  |       SLB  |  10.000465  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     | 10.281173 | 25.262883 | 32.457687 | 1.2725798 |   193415 | 72.664684 |
     |-----------+-----------+-----------+-----------+----------+-----------|
     | zhightech | zinternet |   zexport |   zmobile | myclu~id | myclu~rd  |
     | -.2686491 | -1.328609 | -.4613158 | -.8282211 |       95 |       44  |
     |-----------------------------------+----------------------------------|
     |             myclust~t             |             clustdes             |
     |              .3383064             |                    2             |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. | year  | groups  |           country_name  |  count~de  |   internet  |
     | 2015  |      3  |  Sao Tome and Principe  |       STP  |  25.822249  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     | 10.507292 | 20.564901 | 32.953528 | 3.4519999 |   200157 | 65.094856 |
     |-----------+-----------+-----------+-----------+----------+-----------|
     | zhightech | zinternet |   zexport |   zmobile | myclu~id | myclu~rd  |
     |  -.268649 | -.7836393 | -.6812324 | -1.007052 |       89 |       15  |
     |-----------------------------------+----------------------------------|
     |             myclust~t             |             clustdes             |
     |             .41555429             |                    2             |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. | year  | groups  |           country_name  |  count~de  |   internet  |
     | 2015  |      3  |               Zimbabwe  |       ZWE  |      16.36  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     |    6.6014 | 31.671984 | 38.806322 | 2.2178635 | 10072513 | 84.788804 |
     |-----------+-----------+-----------+-----------+----------+-----------|
     | zhightech | zinternet |   zexport |   zmobile | myclu~id | myclu~rd  |
     |  -.268471 |  -1.10956 | -.1613003 | -.5417992 |      113 |       24  |
     |-----------------------------------+----------------------------------|
     |             myclust~t             |             clustdes             |
     |                     .             |                    2             |
     +----------------------------------------------------------------------+

-------------------------------------------------------------------------------
-> clustdes = 3

     +-----------------------------------------------------------------------+
  1. | year  | groups  |  count~me  |  count~de  |   internet  |     secure  |
     | 2015  |      2  |    Poland  |       POL  |     67.997  |  547.13886  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 47.678286 | 49.878846 |  11.10629 | 1.344e+10 | 148.70655 |  -.026267 |
     |-----------------------------------------------------------------------|
     | zinter~t |  zexport |   zmobile  | myclu~id  | myclu~rd  | myclust~t  |
     | .6690398 | .5879686 |  .9682026  |       83  |       35  | 1.3655879  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      3                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  2. | year  | groups  |  count~me  |  count~de  |   internet  |     secure  |
     | 2015  |      2  |    Brazil  |       BRA  |  59.079478  |  77.056485  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 62.904502 | 57.108831 | 21.446401 | 8.848e+09 | 126.59226 | -.1091318 |
     |-----------------------------------------------------------------------|
     | zinter~t |  zexport |   zmobile  | myclu~id  | myclu~rd  | myclust~t  |
     | .3618822 | 1.300721 |  .4457714  |       17  |       21  | .30032885  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      3                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  3. | year  | groups  |  count~me  |  count~de  |   internet  |     secure  |
     | 2015  |      1  |    France  |       FRA  |    84.6945  |  809.31458  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 55.980877 | 57.902498 | 59.906535 | 1.043e+11 | 102.61316 |  1.612429 |
     |-----------------------------------------------------------------------|
     | zinter~t |  zexport |   zmobile  | myclu~id  | myclu~rd  | myclust~t  |
     | 1.244173 | .9766201 | -.1207142  |       38  |        6  | .33830465  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      3                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  4. | year  | groups  |  count~me  |  count~de  |   internet  |     secure  |
     | 2015  |      1  |   Finland  |       FIN  |    92.6513  |  1781.6448  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 75.998162 | 58.776137 | 9.8340986 | 3.633e+09 | 135.49996 | -.2031575 |
     |-----------------------------------------------------------------------|
     | zinter~t |  zexport |   zmobile  | myclu~id  | myclu~rd  | myclust~t  |
     | 1.518239 | 1.913646 |   .656208  |       37  |       85  | 1.1724461  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      3                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  5. | year  | groups  |  count~me  |  count~de  |   internet  |     secure  |
     | 2015  |      1  |   Germany  |       DEU  |    87.5898  |  1762.7375  |
     |-----------------------------------------------------------------------|
     |    export |    import | telephone |  hightech |    mobile | zhightech |
     | 53.096416 | 44.280126 | 54.930837 | 1.856e+11 | 116.71228 |  3.076627 |
     |-----------------------------------------------------------------------|
     | zinter~t |  zexport |   zmobile  | myclu~id  | myclu~rd  | myclust~t  |
     |   1.3439 | .8415959 |  .2123654  |       40  |       58  | 1.8579401  |
     |-----------------------------------------------------------------------|
     |                               clustdes                                |
     |                                      3                                |
     +-----------------------------------------------------------------------+

-------------------------------------------------------------------------------
-> clustdes = 4

     +------------------------------------------------------------------------+
  1. | year | groups | count~me | count~de | internet |    secure |    export |
     | 2015 |      2 |    China |      CHN |     50.3 | 10.117268 | 44.156282 |
     |------------------------------------------------+-----------+-----------|
     |    import | telephone |  hightech |    mobile  | zhight~h  | zinter~t  |
     | 19.004245 | 16.481036 | 5.543e+11 | 93.161421  | 9.723992  | .0594793  |
     |-----------------------+-----------+------------------------+-----------|
     |  zexport |   zmobile  | myclu~id  | myclu~rd  | myclust~t  | clustdes  |
     | .4231005 | -.3440033  |       24  |       81  | 6.7666829  |        4  |
     +------------------------------------------------------------------------+

-------------------------------------------------------------------------------
-> clustdes = .

     +----------------------------------------------------------------------+
  1. | year  |  groups  |          country_name  |  count~de  |   internet  |
     | 2015  |       3  |      Marshall Islands  |       MHL  |  19.282442  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     |  113.2225 |         . |         . |         . |        . | 29.249146 |
     |----------------------------------------------------------+-----------|
     | zhight~h | zinternet |   zexport |   zmobile | myclu~id  | myclu~rd  |
     |        . | -1.008898 |         . | -1.853876 |        .  |        .  |
     |----------------------------------+-----------------------------------|
     |             myclus~t             |             clustdes              |
     |                    .             |                    .              |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  2. | year  |  groups  |          country_name  |  count~de  |   internet  |
     | 2015  |       3  |               Comoros  |       COM  |  7.4591614  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     |         . |         . |         . | 3.1166484 |        . | 54.801067 |
     |----------------------------------------------------------+-----------|
     | zhight~h | zinternet |   zexport |   zmobile | myclu~id  | myclu~rd  |
     |        . | -1.416143 |         . | -1.250234 |        .  |        .  |
     |----------------------------------+-----------------------------------|
     |             myclus~t             |             clustdes              |
     |                    .             |                    .              |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  3. | year  |  groups  |          country_name  |  count~de  |   internet  |
     | 2015  |       2  |  Syrian Arab Republic  |       SYR  |  29.979797  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     | .91879908 |         . |         . | 18.333711 |        . | 62.446425 |
     |----------------------------------------------------------+-----------|
     | zhight~h | zinternet |   zexport |   zmobile | myclu~id  | myclu~rd  |
     |        . | -.6404355 |         . | -1.069619 |        .  |        .  |
     |----------------------------------+-----------------------------------|
     |             myclus~t             |             clustdes              |
     |                    .             |                    .              |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  4. | year  |  groups  |          country_name  |  count~de  |   internet  |
     | 2015  |       2  |                Bhutan  |       BTN  |       39.8  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     | 16.777874 | 1.6616896 | 43.560414 | 2.8090271 |        . | 87.119379 |
     |----------------------------------------------------------+-----------|
     | zhight~h | zinternet |   zexport |   zmobile | myclu~id  | myclu~rd  |
     |        . | -.3021857 | -1.566108 | -.4867414 |        .  |        .  |
     |----------------------------------+-----------------------------------|
     |             myclus~t             |             clustdes              |
     |                    .             |                    .              |
     +----------------------------------------------------------------------+

     +----------------------------------------------------------------------+
  5. | year  |  groups  |          country_name  |  count~de  |   internet  |
     | 2015  |       3  |               Lesotho  |       LSO  |  16.071708  |
     |----------------------------------------------------------------------|
     |    secure |    export |    import | telephone | hightech |    mobile |
     | 4.2154132 | 22.185663 | 24.251994 | 2.1396942 |        . | 105.52404 |
     |----------------------------------------------------------+-----------|
     | zhight~h | zinternet |   zexport |   zmobile | myclu~id  | myclu~rd  |
     |        . |  -1.11949 | -.6053631 | -.0519471 |        .  |        .  |
     |----------------------------------+-----------------------------------|
     |             myclus~t             |             clustdes              |
     |                    .             |                    .              |
     +----------------------------------------------------------------------+


. save Worldbank_data_with_clusters.dta, replace
(note: file Worldbank_data_with_clusters.dta not found)
file Worldbank_data_with_clusters.dta saved

. 
end of do-file
